StoveSim/simulations/case_21/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
convertToMeters 1;

vertices
(
(0 0 0)
(0 0.15 0)
(0 0 0.095)
(0 0.15 0.095)
(0 0 0.105)
(0 0.15 0.105)
(0 0 0.3)
(0 0.15 0.3)
(0 0 0.33)
(0 0.15 0.33)
(0 -0.03 0.33)
(0 0.18 0.33)
(0 -0.03 0.43)
(0 0.18 0.43)
(0 0 0.43)
(0 0.15 0.43)
(-0.01 0 0)
(-0.01 0.15 0)
(-0.01 0 0.095)
(-0.01 0.15 0.095)
(-0.01 0 0.105)
(-0.01 0.15 0.105)
(-0.01 0 0.3)
(-0.01 0.15 0.3)
(-0.01 0 0.33)
(-0.01 0.15 0.33)
(-0.01 -0.03 0.33)
(-0.01 0.18 0.33)
(-0.01 -0.03 0.43)
(-0.01 0.18 0.43)
(-0.01 0 0.43)
(-0.01 0.15 0.43)

);

blocks
(
hex (0 1 17 16 2 3 19 18) (5 5 5) simpleGrading (1 1 1)
hex (2 3 19 18 4 5 21 20) (5 5 5) simpleGrading (1 1 1)
hex (4 5 21 20 6 7 23 22) (5 5 5) simpleGrading (1 1 1)
hex (6 7 23 22 8 9 25 24) (5 5 5) simpleGrading (1 1 1)
hex (6 6 22 22 10 8 24 26) (5 5 5) simpleGrading (1 1 1)
hex (7 7 23 23 9 11 27 25) (5 5 5) simpleGrading (1 1 1)
hex (10 8 24 26 12 14 30 28) (5 5 5) simpleGrading (1 1 1)
hex (9 11 27 25 15 13 29 31) (5 5 5) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
outlet_LHS
{
type patch;
faces
(
(12 14 30 28)
);
}
outlet_RHS
{
type patch;
faces
(
(15 13 29 31)
);
}
secondary_air_RHS
{
type patch;
faces
(
(3 19 21 5)
);
}
secondary_air_LHS
{
type patch;
faces
(
(2 18 20 4)
);
}
primary_inlet
{
type patch;
faces
(
(0 1 17 16)
);
}
stove_body
{
type patch;
faces
(
(0 16 18 2)
(1 17 19 3)
(4 20 22 6)
(5 21 23 7)
(6 22 22 6)
(7 23 23 7)
(11 27 29 13)
(9 25 31 15)
(8 24 30 14)
(10 26 28 12)
(8 9 25 24)
);
}

frontAndBack
{
type empty;
faces
(
(0 1 3 2)
(16 17 19 18)
(2 3 5 4)
(18 19 21 20)
(4 5 7 6)
(20 21 23 22)
(6 7 9 8)
(22 23 25 24)
(10 8 14 12)
(26 24 30 28)
(9 11 13 15)
(25 27 29 31)
);
}
);

mergePatchPairs
(
);
// ************************************************************************* //